<div style="background: #000;
            color: #FFF;
            margin: 0px;
                padding: 10px 0px 20px 0px;
            text-align: center; 
                ">
    <h1>Week 9 - Homework</h1>
</div>

For each question below, paste in the query or queries you used in order to answer the question. Also INCLUDE A SCREENSHOT of the results from your query.

Remeber to check the ER Diagram to understand where the different pieces of information you need live: https://www.jooq.org/sakila


1. What are the names of all the languages in the database (sorted alphabetically)?
2. Return the full names (first and last) of actors with “SON” in their last name, ordered by their first name.
3. Find all the addresses where the second address is not empty (i.e., contains some text), and return these second addresses sorted.
4. Return the first and last names of actors who played in a film involving a “Crocodile” and a “Shark”, along with the release year of the movie, sorted by the actors’ last names.
5. How many films involve a “Crocodile” and a “Shark”?
6. Find all the film categories in which there are between 55 and 65 films. Return the names of these categories and the number of films per category, sorted by the number of films.
7. What are the top 10 largest payments? Sort largest to smallest.
8. Which actors have the first name ‘Scarlett’? Sort by last name descending.
9 Which actors have the last name ‘Johansson’? Sort by first name ascending.
10. How many distinct actors last names are there?
11. Which last names are not repeated?
12. Which last names appear more than once?
13. Which actor has appeared in the most films?
14. Is ‘Academy Dinosaur’ available for rent from Store 1?
15. Insert a record to represent Mary Smith renting ‘Academy Dinosaur’ from Mike Hillyer at Store 1 today .
16. When is ‘Academy Dinosaur’ due?
17. What is that average running time of all the films in the sakila DB?
18. What is the average running time of films by category?

Bonus Question 1:

Create a new table called "theater". It should have at least 5 attributes: one primary key, two foreign keys (from existing tables), and two other attributes of your choosing. Insert at least 5 records into the table. Paste below the query you used to make the table, and a screenshot of the table with it's data (SELECT * from it when done).

Bonus Question 2:

Create a new table from an existing one. Change at least three of the data types of the new table. Sort the new table by any column of your choosing and delete the last 10 rows based on however you sorted. Include all the queries you used below. Prove that you completed the steps above.

# Q1: What are the names of all the languages in the database (sorted alphabetically)?

select *
from language
order by name;

<img src='sql_images/q1.jpg'>

# Q2: Return the full names (first and last) of actors with “SON” in their last name, ordered by their first name.

SELECT first_name, last_name 
FROM actor
where last_name like '%SON%'
order by first_name;

<img src='sql_images/q2.jpg'>

# q3: Find all the addresses where the second address is not empty (i.e., contains some text), and return these second addresses sorted.

SELECT address2
FROM address
where address2 is not NULL
order by address2

<img src='sql_images/q3.jpg'>

# q4: Return the first and last names of actors who played in a film involving a “Crocodile” and a “Shark”, along with the release year of the movie, sorted by the actors’ last names.

select  distinct actor.first_name,actor.last_name, film.release_year
From actor
inner JOIN film_actor on film_actor.actor_id=actor.actor_id
inner join film on film_actor.film_id=film.film_id
where film.description like '%Shark%' and film.description like '%Crocodile%'
order by actor.last_name

<img src='sql_images/q4.jpg'>

# q5: How many films involve a “Crocodile” and a “Shark”?

select count(film_id)
from film
where description like '%Shark%' and description like '%Crocodile%'

<img src='sql_images/q5.jpg'>

# q6: Find all the film categories in which there are between 55 and 65 films. Return the names of these categories and the number of films per category, sorted by the number of films.

select name , count(name) as films_per_category
from category
inner join film_category on film_category.category_id=category.category_id
where film_category.film_id between 55 and 65
group by category.name;

<img src='sql_images/q6.jpg'>

# q7: What are the top 10 largest payments? Sort largest to smallest.

SELECT * 
FROM sakila.payment
order by amount desc
limit 10;

<img src='sql_images/q7.jpg'>

# q8: Which actors have the first name ‘Scarlett’? Sort by last name descending. 9 Which actors have the last name ‘Johansson’? Sort by first name ascending.

# first part
select *
from actor
where first_name like 'Scarlett'
order by last_name desc

<img src='sql_images/q81.jpg'>

# second part
select *
from actor
where last_name like 'Johansson'
order by first_name asc

<img src='sql_images/q82.jpg'>

# q9: How many distinct actors last names are there?

select COUNT( DISTINCT last_name)
from actor

<img src='sql_images/q9.jpg'>

# q10: Which last names are not repeated?

select last_name 
from actor
group by last_name
having count(last_name) <=1;

<img src='sql_images/q10.jpg'>

# q11: Which last names appear more than once?

select last_name 
from actor
group by last_name
having count(last_name) > 1;

<img src='sql_images/q11.jpg'>

# q12:Which actor has appeared in the most films  ?

select actor.last_name, actor.first_name, max(film_actor.actor_id)
from actor
inner join film_actor on film_actor.actor_id=actor.actor_id
group by film_actor.actor_id
order by film_actor.actor_id desc
limit 1

<img src='sql_images/q12.jpg'>

# q13: Is ‘Academy Dinosaur’ available for rent from Store 1?
Answer:
Yes.

SELECT film.film_id, film.title, film.description
from film
inner join inventory
on film.film_id=inventory.film_id
where film.title like 'Academy Dinosaur'
and inventory.inventory_id in (
select inventory.inventory_id
from inventory
left join rental
on inventory.inventory_id=rental.inventory_id
)

<img src='sql_images/q13.jpg'>

# q14: Insert a record to represent Mary Smith renting ‘Academy Dinosaur’ from Mike Hillyer at Store 1 today

# first getting the customer id for Mary Smith: customer_id=1
SELECT customer_id FROM customer
where (first_name = 'Mary'
AND last_name = 'Smith');

# second getting info about the movie Academy Dinosaur: film_id=1, 
SELECT * FROM sakila.film
where title='Academy Dinosaur'

#third step, getting the inventory information: inventory_id = 1 and store_id=1, last_update= 2006-02-15
SELECT * FROM sakila.inventory
where inventory_id=1;

# finally knowing data about staff: staff_id=1 that is related to Mike Hillyer
SELECT * 
FROM sakila.staff
where first_name like 'Mike'
and last_name like 'Hillyer';

# Right now we have enough data for each attributes we need to deal with: 
We will enter data into table rental
---
we need: 
--
rental_id=1
-
rental_date=2021-11-14
-
inventory_id=1
-
customer_id=1
-
staff_id=1
-
last_update=2021-11-14

#SQL 
INSERT INTO `sakila`.`rental`
(`rental_id`,
`rental_date`,
`inventory_id`,
`customer_id`,
`return_date`,
`staff_id`,
`last_update`)
VALUES
(16050,
11/14/2021,
1,
1,
11/20/2021,
1,
11/14/2021);

<img src='sql_images/q14.jpg'>

# q15: When is ‘Academy Dinosaur’ due?

select rental_date,
       rental_date + interval
                   (select rental_duration from film where film_id = 1) day
                   as due_date
from rental
where rental_id = (select rental_id from rental order by rental_id desc limit 1);

<img src='sql_images/q15.jpg'>

# q16: What is that average running time of all the films in the sakila DB?

# I treated running time as the length of the movie
select avg(length) from film;

<img src='sql_images/q16.jpg'>

# q17: What is the average running time of films by category?

select category.name, avg(length) as average_by_category
from film 
join film_category 
on film_category.film_id=film.film_id
join category
on film_category.category_id=category.category_id
group by category.name

<img src='sql_images/q17.jpg'>